base/Catalogs/бит_КомандыБотуТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КомандыБотуТелеграм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстКлавиатуры</Name>
					<Comment>Текст отображаемый на клавиатуре</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Определение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПолученияДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ИсточникиПолученияДанныхТелеграм</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВнешнийЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТолькоПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНачалоИКонецПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВВерхнемРегистре</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКоманды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКомандТелеграм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполняемыйОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыФормированияОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыКомандТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыКомандТелеграм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_КомандыБотуТелеграм/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьВнешнийЗапрос = Объект.ИспользоватьВнешнийЗапрос;
	
	Если Параметры.Ключ.Пустая() Тогда
	
		Объект.ИсточникПолученияДанных = Объект.Ссылка;
		
	КонецЕсли; 

	УправлениеЭлементамиФормы();
	ЗаполнитьДоступныеИсполняемыеОтчеты();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьПраметрыИсполняемогоОтчета(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПараметрыОтчетаПолучены = (ТекущийОбъект.ПараметрыФормированияОтчета.Получить() <> Неопределено);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПолученыПараметрыФормированияОтчета" Тогда
		ПараметрыИсполняемогоОтчета = Параметр;
		ПараметрыОтчетаПолучены     = Истина;
		УправлениеЭлементамиФормы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьВнешнийЗапросПриИзменении(Элемент)
	ИспользоватьВнешнийЗапросПриИзмененииСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТолькоПериодПриИзменении(Элемент)
	ИспользованиеДат();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнтервалМеждуДатамиПриИзменении(Элемент)
	ИспользованиеДат();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПолученияДанныхПриИзменении(Элемент)
	ЗаполнитьПараметрыИзЗапросаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидКомандыПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполняемыйОтчетПриИзменении(Элемент)
	
	ПараметрыОтчетаПолучены = Ложь;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПараметрыИзЗапроса(Команда)
	
	Если ЗначениеЗаполнено(Объект.Запрос) Тогда
		Если Объект.Параметры.Количество() > 0 Тогда
			Текст = НСтр("ru='Таблица параметров не пуста. Очистить таблицу?';
						 |en='parameter table is not empty. Clear the table?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПараметрыЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, Текст, РежимДиалогаВопрос.ДаНет);
		Иначе
			ЗаполнитьПараметрыЗавершение(КодВозвратаДиалога.Да, Неопределено);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Заполнить параметры завершение.
//
// Параметры:
//  Ответ					 - КодВозвратаДиалога - ответ на вопрос.
//  ДополнительныеПараметры	 - Структура - параметры.
//
&НаКлиенте
Процедура ЗаполнитьПараметрыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
	
		Объект.Параметры.Очистить();
		
	КонецЕсли; 
	
	ЗаполнитьПараметрыИзЗапросаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПараметрыОтчета(Команда)
	
	ПараметрыОтчета = ПараметрыИсполняемогоОтчетаДляЗагрузки();
	
	НаименованиеОтчета = НаименованиеИсполняемогоОтчета();
	ФормаОтчета = "Отчет.%1.Форма";
	ФормаОтчета = СтрШаблон(ФормаОтчета, НаименованиеОтчета);
	ОткрытьФорму(ФормаОтчета, ПараметрыОтчета, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()

	ЭтотОбъект.ТолькоПросмотр 					= Объект.Предопределенный;
	Элементы.ИсточникПолученияДанных.Видимость 	= ИспользоватьВнешнийЗапрос;
	Элементы.Запрос.Видимость 					= НЕ ИспользоватьВнешнийЗапрос;
	
	ЭтоЗапрос = (Объект.ВидКоманды = Перечисления.бит_ВидыКомандТелеграм.Запрос);
	Если ЭтоЗапрос Тогда
		Элементы.СтраницыНастройкиКоманды.ТекущаяСтраница = Элементы.СтраницаЗапрос;
	КонецЕсли;
	Элементы.ИспользоватьТолькоПериод.Видимость        = ЭтоЗапрос;
	Элементы.ДекорацияПериод.Видимость                 = ЭтоЗапрос;
	Элементы.ИспользоватьИнтервалМеждуДатами.Видимость = ЭтоЗапрос;
	Элементы.ДекорацияИнтервал.Видимость               = ЭтоЗапрос;
	Элементы.Параметры.Видимость                       = ЭтоЗапрос;
	Элементы.Запрос.Видимость                          = ЭтоЗапрос;
	Элементы.ИспользоватьВнешнийЗапрос.Видимость       = ЭтоЗапрос;
	Элементы.ИсточникПолученияДанных.Видимость         = ЭтоЗапрос;
	
	ЭтоОтчет = (Объект.ВидКоманды = Перечисления.бит_ВидыКомандТелеграм.Отчет);
	Если ЭтоОтчет Тогда
		Элементы.СтраницыНастройкиКоманды.ТекущаяСтраница = Элементы.СтраницаОтчет;
	КонецЕсли;
	Элементы.ИсполняемыйОтчет.Видимость = ЭтоОтчет;
	Элементы.ЗагрузитьПараметрыОтчета.Видимость      = ЭтоОтчет;
	Элементы.ПредупреждениеОграниченияПрав.Видимость = ЭтоОтчет;
	Элементы.ЗагрузитьПараметрыОтчета.Доступность    = НЕ Объект.ИсполняемыйОтчет.Пустая();
	Если ПараметрыОтчетаПолучены Тогда
		Элементы.ЗагрузитьПараметрыОтчета.Заголовок  = НСтр("ru='Изменить параметры отчета';
														|en='Update report parameters'");
		Элементы.ЗагрузитьПараметрыОтчета.ЦветТекста = ЦветаСтиля.бит_ЦветЗаголовкаСтатуса;
	Иначе
		Элементы.ЗагрузитьПараметрыОтчета.Заголовок  = НСтр("ru='Загрузить параметры отчета';
														|en='Download report parameters'");
		Элементы.ЗагрузитьПараметрыОтчета.ЦветТекста = ЦветаСтиля.бит_ЦветГиперссылки;
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Процедура ИспользованиеДат()

	Если Объект.ИспользоватьТолькоПериод
		И Объект.ИспользоватьНачалоИКонецПериода Тогда
	
		Объект.ИспользоватьНачалоИКонецПериода = Ложь;
		Объект.ИспользоватьТолькоПериод = Ложь;
	
	КонецЕсли; 

КонецПроцедуры // ИспользованиеДат()

&НаСервере
Процедура ИспользоватьВнешнийЗапросПриИзмененииСервер()

	ИспользоватьВнешнийЗапрос = Объект.ИспользоватьВнешнийЗапрос;
	
	Если НЕ ИспользоватьВнешнийЗапрос Тогда
	
		Объект.ИсточникПолученияДанных = Объект.Ссылка;
		
	Иначе	
		Объект.ИсточникПолученияДанных = Неопределено;
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();

КонецПроцедуры // ИспользоватьВнешнийЗапросПриИзмененииСервер()

&НаСервере
Процедура ЗаполнитьПараметрыИзЗапросаНаСервере()
	
	Если Объект.ИспользоватьВнешнийЗапрос Тогда 
		
		Если ТипЗнч(Объект.ИсточникПолученияДанных) = Тип("СправочникСсылка.бит_Запросы") Тогда
			
			Объект.Запрос = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсточникПолученияДанных, "ТекстЗапроса");
			Объект.Параметры.Очистить();
			
		ИначеЕсли ТипЗнч(Объект.ИсточникПолученияДанных) = Тип("СправочникСсылка.бит_КомандыБотуТелеграм") Тогда
			
			Объект.Запрос = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсточникПолученияДанных, "Запрос");
			Объект.Параметры.Очистить();
			
		КонецЕсли;	
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Запрос) Тогда
		Возврат;	
	КонецЕсли; 
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Объект.Запрос);
	
	ОписаниеПараметровЗапроса = Схема.НайтиПараметры();
	
	Для каждого СтрОписания Из ОписаниеПараметровЗапроса Цикл
		
		Если ЭтоТиповойПараметр(СтрОписания.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПараметров = Объект.Параметры.Добавить();
		СтрокаПараметров.Наименование = СтрОписания.Имя;
		
		ДоступныеТипы = СтрОписания.ТипЗначения.Типы();
		Если ДоступныеТипы.Количество()=0 Тогда
			СтрокаПараметров.Значение = ЗначениеВСтрокуВнутр("");
			
		Иначе	
			Массив = Новый Массив;
			Массив.Добавить(ДоступныеТипы.Получить(0));
			НовоеОписаниеТипов	= Новый ОписаниеТипов(Массив);
			
			СтрокаПараметров.Значение = НовоеОписаниеТипов.ПривестиЗначение(Неопределено);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ЭтоТиповойПараметр(ИмяПараметра)

	ЭтоТиповой = Ложь;
	
	Если ИмяПараметра = "Период"
		ИЛИ ИмяПараметра = "НачалоПериода"
		ИЛИ ИмяПараметра = "КонецПериода" Тогда
	
		ЭтоТиповой = Истина;
	
	КонецЕсли; 

	Возврат ЭтоТиповой;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДоступныеИсполняемыеОтчеты()
	
	ДоступныеОтчеты = Новый Массив;
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ДоступныеОтчеты.Добавить("Отчет.бит_АнализПричинРасхожденийБюджета");
		ДоступныеОтчеты.Добавить("Отчет.бит_БухгалтерскийОтчетУправленческийБезКорреспонденции");
		ДоступныеОтчеты.Добавить("Отчет.бит_БухгалтерскийОтчетУправленческийСКорреспонденцией");
		ДоступныеОтчеты.Добавить("Отчет.бит_ВедомостьПоЗаявкамНаРасходДенежныхСредств");
		ДоступныеОтчеты.Добавить("Отчет.бит_ГотовностьПравилТрансляции");
		ДоступныеОтчеты.Добавить("Отчет.бит_ГрафикиДоговоров");
		ДоступныеОтчеты.Добавить("Отчет.бит_ЗаявкиВключенныеВРеестрПлатежей");
		ДоступныеОтчеты.Добавить("Отчет.бит_ИсполнениеДоговоров");
		ДоступныеОтчеты.Добавить("Отчет.бит_КарточкаСчетаУправленческий");
		ДоступныеОтчеты.Добавить("Отчет.бит_КонтрольныеЗначенияБюджета");
		ДоступныеОтчеты.Добавить("Отчет.бит_НеснижаемыеОстатки");
		ДоступныеОтчеты.Добавить("Отчет.бит_ОборотыБюджета");
		ДоступныеОтчеты.Добавить("Отчет.бит_ОборотыБюджетаИОстаткиПоСчетам");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПланируемоеПоступлениеДенежныхСредств");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПланФактныйАнализБюджета");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПланФактныйАнализБюджетаИОстаткиПоСчетам");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПланФактныйАнализЗаявокНаРасходованиеДенежныхСредств");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПланФактныйАнализПоПрогнозамПлатежей");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПланФактныйАнализПоступленийДенежныхСредств");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПретензионноИсковаяРабота");
		ДоступныеОтчеты.Добавить("Отчет.бит_ПрогнозИсполненияБюджета");
		ДоступныеОтчеты.Добавить("Отчет.бит_РеестрДоговоров");
		ДоступныеОтчеты.Добавить("Отчет.бит_СведенияОбОстаткахДенежныхСредств");
		ДоступныеОтчеты.Добавить("Отчет.бит_СоответствияАналитик");
		ДоступныеОтчеты.Добавить("Отчет.бит_УниверсальныеСоответствияАналитик");
		ДоступныеОтчеты.Добавить("Отчет.бит_ШахматнаяВедомостьУправленческий");
	КонецЕсли;
	
	Для каждого Отчет Из ДоступныеОтчеты Цикл
		ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Отчет);
		Элементы.ИсполняемыйОтчет.СписокВыбора.Добавить(ИдентификаторОтчета);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеИсполняемогоОтчета()
	
	Возврат Объект.ИсполняемыйОтчет.Имя;
	
КонецФункции

&НаСервере
Процедура СохранитьПраметрыИсполняемогоОтчета(ТекущийОбъект)
	
	Если ПараметрыОтчетаПолучены
		И НЕ ЭтоАдресВременногоХранилища(ПараметрыИсполняемогоОтчета) Тогда
		// Данные не менялись.
		Возврат;
	КонецЕсли;
	
	ПараметрыОтчета = Неопределено;
	Если ПараметрыОтчетаПолучены
		И ЭтоАдресВременногоХранилища(ПараметрыИсполняемогоОтчета) Тогда
		ПараметрыОтчета = ПолучитьИзВременногоХранилища(ПараметрыИсполняемогоОтчета);
	КонецЕсли;
	
	ТекущийОбъект.ПараметрыФормированияОтчета = Новый ХранилищеЗначения(ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыИсполняемогоОтчетаДляЗагрузки()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("бит_ПолучениеПараметров", Истина);
	
	Если НЕ ПараметрыОтчетаПолучены Тогда
		Возврат ПараметрыОтчета;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ПараметрыИсполняемогоОтчета) Тогда
		СохраненныеПараметры = ПолучитьИзВременногоХранилища(ПараметрыИсполняемогоОтчета);
	Иначе
		СохраненныеПараметры = РеквизитФормыВЗначение("Объект").ПараметрыФормированияОтчета.Получить();
		ПараметрыИсполняемогоОтчета = ПоместитьВоВременноеХранилище(СохраненныеПараметры, УникальныйИдентификатор);
	КонецЕсли;
	ПараметрыОтчета.Вставить("бит_ПараметрыИсполняемогоОтчета", ПараметрыИсполняемогоОтчета);
	ПараметрыОтчета.Вставить("КлючВарианта",                    СохраненныеПараметры.КлючВарианта);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

#КонецОбласти
